#pragma once

// SDK BY - @Manish8x (4.2.0 -- 64Bit) SDK 工具 By 无名 @Manish8x
// Telegram频道:- @Manish8x
// 此文件生成时间Thu Jan 15 10:48:29 2026
 
namespace SDK
{
//---------------------By 无名 @Manish8x---------------------------
//Script Structs
//---------------------By 无名 @Manish8x---------------------------

// UserDefinedStruct ItemRecordData5.ItemRecordData5
// 0x0038
struct FItemRecordData5
{
	int                                                ItemID_2_2F9636FC420298B4EF34E588F58E38B0;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemType_4_B2ED20EE489C1F500EBA389884CAC16D;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ItemName_7_DEB27023488D6036B9B24AB5DB114F34;              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ItemBigIcon_9_A4409DA14B47CD0F4D6A7EBB7CBF2F2F;           // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ItemDesc_11_8AB433674EC5E4AF7F82069136B23CF5;             // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

